lkolbly/cmsis-svd/data/TexasInstruments/LM3S5737.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SSI0">
      <name>SSI1</name>
      <prependToName>SSI1</prependToName>
      <baseAddress>0x40009000</baseAddress>
    </peripheral>
    <peripheral>
      <name>UART0</name>
      <description>Register map for UART0 peripheral</description>
      <groupName>UART</groupName>
      <prependToName>UART0</prependToName>
      <baseAddress>0x4000C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <description>UART Data</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>UART_DR_DATA</name>
              <description>Data Transmitted or Received</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>UART_DR_FE</name>
              <description>UART Framing Error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UART_DR_PE</name>
              <description>UART Parity Error</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UART_DR_BE</name>
              <description>UART Break Error</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UART_DR_OE</name>
              <description>UART Overrun Error</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSR</name>
          <description>UART Receive Status/Error Clear</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>UART_RSR_FE</name>
              <description>UART Framing Error</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_RSR_PE</name>
              <description>UART Parity Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_RSR_BE</name>
              <description>UART Break Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UART_RSR_OE</name>
              <description>UART Overrun Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECR</name>
          <description>UART Receive Status/Error Clear</description>
          <alternateGroup>UART_ALT</alternateGroup>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>UART_ECR_DATA</name>
              <description>Error Clear</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <description>UART Flag</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>UART_FR_BUSY</name>
              <description>UART Busy</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UART_FR_RXFE</name>
              <description>UART Receive FIFO Empty</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UART_FR_TXFF</name>
              <description>UART Transmit FIFO Full</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UART_FR_RXFF</name>
              <description>UART Receive FIFO Full</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UART_FR_TXFE</name>
              <description>UART Transmit FIFO Empty</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ILPR</name>
          <description>UART IrDA Low-Power Register</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>UART_ILPR_ILPDVSR</name>
              <description>IrDA Low-Power Divisor</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IBRD</name>
          <description>UART Integer Baud-Rate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>UART_IBRD_DIVINT</name>
              <description>Integer Baud-Rate Divisor</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FBRD</name>
          <description>UART Fractional Baud-Rate Divisor</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>UART_FBRD_DIVFRAC</name>
              <description>Fractional Baud-Rate Divisor</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCRH</name>
          <description>UART Line Control</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>UART_LCRH_BRK</name>
              <description>UART Send Break</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_LCRH_PEN</name>
              <description>UART Parity Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_LCRH_EPS</name>
              <description>UART Even Parity Select</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UART_LCRH_STP2</name>
              <description>UART Two Stop Bits Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UART_LCRH_FEN</name>
              <description>UART Enable FIFOs</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UART_LCRH_WLEN</name>
              <description>UART Word Length</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_5</name>
                  <description>5 bits (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_6</name>
                  <description>6 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_7</name>
                  <description>7 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_LCRH_WLEN_8</name>
                  <description>8 bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART_LCRH_SPS</name>
              <description>UART Stick Parity Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>UART Control</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>UART_CTL_UARTEN</name>
              <description>UART Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_CTL_SIREN</name>
              <description>UART SIR Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_CTL_SIRLP</name>
              <description>UART SIR Low-Power Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UART_CTL_LBE</name>
              <description>UART Loop Back Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UART_CTL_TXE</name>
              <description>UART Transmit Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UART_CTL_RXE</name>
              <description>UART Receive Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFLS</name>
          <description>UART Interrupt FIFO Level Select</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>UART_IFLS_TX</name>
              <description>UART Transmit Interrupt FIFO Level Select</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_IFLS_TX1_8</name>
                  <description>TX FIFO &amp;lt;= 1/8 full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX2_8</name>
                  <description>TX FIFO &amp;lt;= 1/4 full</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX4_8</name>
                  <description>TX FIFO &amp;lt;= 1/2 full (default)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX6_8</name>
                  <description>TX FIFO &amp;lt;= 3/4 full</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_TX7_8</name>
                  <description>TX FIFO &amp;lt;= 7/8 full</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART_IFLS_RX</name>
              <description>UART Receive Interrupt FIFO Level Select</description>
              <bitRange>[5:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_IFLS_RX1_8</name>
                  <description>RX FIFO >= 1/8 full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX2_8</name>
                  <description>RX FIFO >= 1/4 full</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX4_8</name>
                  <description>RX FIFO >= 1/2 full (default)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX6_8</name>
                  <description>RX FIFO >= 3/4 full</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_IFLS_RX7_8</name>
                  <description>RX FIFO >= 7/8 full</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>UART Interrupt Mask</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>UART_IM_RXIM</name>
              <description>UART Receive Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UART_IM_TXIM</name>
              <description>UART Transmit Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UART_IM_RTIM</name>
              <description>UART Receive Time-Out Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UART_IM_FEIM</name>
              <description>UART Framing Error Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UART_IM_PEIM</name>
              <description>UART Parity Error Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UART_IM_BEIM</name>
              <description>UART Break Error Interrupt Mask</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UART_IM_OEIM</name>
              <description>UART Overrun Error Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>UART Raw Interrupt Status</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>UART_RIS_RXRIS</name>
              <description>UART Receive Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UART_RIS_TXRIS</name>
              <description>UART Transmit Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UART_RIS_RTRIS</name>
              <description>UART Receive Time-Out Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UART_RIS_FERIS</name>
              <description>UART Framing Error Raw Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UART_RIS_PERIS</name>
              <description>UART Parity Error Raw Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UART_RIS_BERIS</name>
              <description>UART Break Error Raw Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UART_RIS_OERIS</name>
              <description>UART Overrun Error Raw Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>UART Masked Interrupt Status</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>UART_MIS_RXMIS</name>
              <description>UART Receive Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UART_MIS_TXMIS</name>
              <description>UART Transmit Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UART_MIS_RTMIS</name>
              <description>UART Receive Time-Out Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UART_MIS_FEMIS</name>
              <description>UART Framing Error Masked Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UART_MIS_PEMIS</name>
              <description>UART Parity Error Masked Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UART_MIS_BEMIS</name>
              <description>UART Break Error Masked Interrupt Status</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UART_MIS_OEMIS</name>
              <description>UART Overrun Error Masked Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>UART Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UART_ICR_RXIC</name>
              <description>Receive Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_TXIC</name>
              <description>Transmit Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_RTIC</name>
              <description>Receive Time-Out Interrupt Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_FEIC</name>
              <description>Framing Error Interrupt Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_PEIC</name>
              <description>Parity Error Interrupt Clear</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_BEIC</name>
              <description>Break Error Interrupt Clear</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UART_ICR_OEIC</name>
              <description>Overrun Error Interrupt Clear</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <description>UART DMA Control</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>UART_DMACTL_RXDMAE</name>
              <description>Receive DMA Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_DMACTL_TXDMAE</name>
              <description>Transmit DMA Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART_DMACTL_DMAERR</name>
              <description>DMA on Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
